In [198]:
import pandas as pd

In [199]:
people = {"first":["Ali","Ahmed","mohamed"],"last":["hassan","omar","omar"],"email":["ali@gmial.com","ahmed@gmail.com","mohamed@gmail.com"]}

In [200]:
df = pd.DataFrame(people)
df

     first    last              email
0      Ali  hassan      ali@gmial.com
1    Ahmed    omar    ahmed@gmail.com
2  mohamed    omar  mohamed@gmail.com

In [201]:
#changing all coulmns names

In [202]:
df.columns = ["firstName","lastName","email"]
df

  firstName lastName              email
0       Ali   hassan      ali@gmial.com
1     Ahmed     omar    ahmed@gmail.com
2   mohamed     omar  mohamed@gmail.com

In [203]:
#looping in columns header

In [204]:
df.columns = [x.upper() for x in df.columns]
df

  FIRSTNAME LASTNAME              EMAIL
0       Ali   hassan      ali@gmial.com
1     Ahmed     omar    ahmed@gmail.com
2   mohamed     omar  mohamed@gmail.com

In [205]:
df.columns = df.columns.str.replace("FIRSTNAME","first") 
df

     first LASTNAME              EMAIL
0      Ali   hassan      ali@gmial.com
1    Ahmed     omar    ahmed@gmail.com
2  mohamed     omar  mohamed@gmail.com

In [206]:
#we can did the previous replace using other way

In [207]:
df.rename(columns={"firstName":"first_name","lastName":"last_name"},inplace =True)

In [208]:
df

     first LASTNAME              EMAIL
0      Ali   hassan      ali@gmial.com
1    Ahmed     omar    ahmed@gmail.com
2  mohamed     omar  mohamed@gmail.com

In [209]:
df.loc[2,["first","LASTNAME"]] = ["gazar","badran"] # it's better to use df.at[] if dealing with one change
df

   first LASTNAME              EMAIL
0    Ali   hassan      ali@gmial.com
1  Ahmed     omar    ahmed@gmail.com
2  gazar   badran  mohamed@gmail.com

In [210]:
filt = (df["LASTNAME"]=="badran")

In [211]:
df.loc[filt,"LASTNAME"] = "elzahar"

In [212]:
df

   first LASTNAME              EMAIL
0    Ali   hassan      ali@gmial.com
1  Ahmed     omar    ahmed@gmail.com
2  gazar  elzahar  mohamed@gmail.com

In [213]:
#apply

In [214]:
df["first"].apply(len)

0    3
1    5
2    5
Name: first, dtype: int64

In [215]:
def update_email(email):
    return email.upper()

In [216]:
df["EMAIL"].apply(update_email)

0        ALI@GMIAL.COM
1      AHMED@GMAIL.COM
2    MOHAMED@GMAIL.COM
Name: EMAIL, dtype: object

In [217]:
df["EMAIL"] =df["EMAIL"].apply(update_email)
df

   first LASTNAME              EMAIL
0    Ali   hassan      ALI@GMIAL.COM
1  Ahmed     omar    AHMED@GMAIL.COM
2  gazar  elzahar  MOHAMED@GMAIL.COM

In [218]:
df["EMAIL"] = df["EMAIL"].apply(lambda x:x.lower())
df

   first LASTNAME              EMAIL
0    Ali   hassan      ali@gmial.com
1  Ahmed     omar    ahmed@gmail.com
2  gazar  elzahar  mohamed@gmail.com

In [219]:
#applymap--> run function  in all

In [221]:
df.applymap(len)

C:\Users\ALKADY\AppData\Local\Temp\ipykernel_14252\2417450605.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  LASTNAME  EMAIL
0      3         6     13
1      5         4     15
2      5         7     17

In [223]:
df.applymap(str.lower)

C:\Users\ALKADY\AppData\Local\Temp\ipykernel_14252\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

   first LASTNAME              EMAIL
0    ali   hassan      ali@gmial.com
1  ahmed     omar    ahmed@gmail.com
2  gazar  elzahar  mohamed@gmail.com

In [226]:
df["first"] = df["first"].replace({"Ali":"Alkady","Ahmed":"layla"})
df

    first LASTNAME              EMAIL
0  Alkady   hassan      ali@gmial.com
1   layla     omar    ahmed@gmail.com
2   gazar  elzahar  mohamed@gmail.com